xml/getDnsRecords.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.rex">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getDnsRecords soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <domain xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">__PARAM__domain__</domain>
      </web:getDnsRecords>
   </soapenv:Body>
</soapenv:Envelope>